arturk70/ZX_and_CPM_on_STM32/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
#include "stm32f1xx_ll_dma.h"
#include "stm32f1xx_ll_rcc.h"
#include "stm32f1xx_ll_bus.h"
#include "stm32f1xx_ll_system.h"
#include "stm32f1xx_ll_exti.h"
#include "stm32f1xx_ll_cortex.h"
#include "stm32f1xx_ll_utils.h"
#include "stm32f1xx_ll_pwr.h"
#include "stm32f1xx_ll_spi.h"
#include "stm32f1xx_ll_tim.h"
#include "stm32f1xx.h"
#include "stm32f1xx_ll_gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin LL_GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define KBD_2_Pin LL_GPIO_PIN_0
#define KBD_2_GPIO_Port GPIOA
#define KBD_3_Pin LL_GPIO_PIN_2
#define KBD_3_GPIO_Port GPIOA
#define ILI9341_DC_Pin LL_GPIO_PIN_3
#define ILI9341_DC_GPIO_Port GPIOA
#define ILI9341_CS_Pin LL_GPIO_PIN_4
#define ILI9341_CS_GPIO_Port GPIOA
#define KBD_0_Pin LL_GPIO_PIN_0
#define KBD_0_GPIO_Port GPIOB
#define KBD_1_Pin LL_GPIO_PIN_1
#define KBD_1_GPIO_Port GPIOB
#define KBDA_15_Pin LL_GPIO_PIN_10
#define KBDA_15_GPIO_Port GPIOB
#define KBD_4_Pin LL_GPIO_PIN_11
#define KBD_4_GPIO_Port GPIOB
#define SD_CS_Pin LL_GPIO_PIN_12
#define SD_CS_GPIO_Port GPIOB
#define KBDA_8_Pin LL_GPIO_PIN_3
#define KBDA_8_GPIO_Port GPIOB
#define KBDA_9_Pin LL_GPIO_PIN_4
#define KBDA_9_GPIO_Port GPIOB
#define KBDA_10_Pin LL_GPIO_PIN_5
#define KBDA_10_GPIO_Port GPIOB
#define KBDA_11_Pin LL_GPIO_PIN_6
#define KBDA_11_GPIO_Port GPIOB
#define KBDA_12_Pin LL_GPIO_PIN_7
#define KBDA_12_GPIO_Port GPIOB
#define KBDA_13_Pin LL_GPIO_PIN_8
#define KBDA_13_GPIO_Port GPIOB
#define KBDA_14_Pin LL_GPIO_PIN_9
#define KBDA_14_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
